//NetCDF Error String Localization file


"No error" = "No error";
"Not a netCDF id" = "Not a netCDF id";
"Too many netCDF files open" = "Too many netCDF files open";
"netCDF file exists && NC_NOCLOBBER" = "netCDF file exists && NC_NOCLOBBER";
"Invalid argument" = "Invalid argument";
"Write to read only" = "Write to read only";
"Operation not allowed in data mode" = "Operation not allowed in data mode";
"Operation not allowed in define mode" = "Operation not allowed in define mode";
"Index exceeds dimension bound" = "Index exceeds dimension bound";
"NC_MAX_DIMS exceeded" = "NC_MAX_DIMS exceeded";
"String match to name in use" = "String match to name in use";
"Attribute not found" = "Attribute not found";
"NC_MAX_ATTRS exceeded" = "NC_MAX_ATTRS exceeded";
"Not a netCDF data type or _FillValue type mismatch" = "Not a netCDF data type or _FillValue type mismatch";
"Invalid dimension id or name" = "Invalid dimension id or name";
"NC_UNLIMITED in the wrong index" = "NC_UNLIMITED in the wrong index";
"NC_MAX_VARS exceeded" = "NC_MAX_VARS exceeded";
"Variable not found" = "Variable not found";
"Action prohibited on NC_GLOBAL varid" = "Action prohibited on NC_GLOBAL varid";
"Not a netCDF file" = "Not a netCDF file";
"In Fortran, string too short" = "In Fortran, string too short";
"NC_MAX_NAME exceeded" = "NC_MAX_NAME exceeded";
"NC_UNLIMITED size already in use" = "NC_UNLIMITED size already in use";
"nc_rec op when there are no record vars" = "nc_rec op when there are no record vars";
"Attempt to convert between text & numbers" = "Attempt to convert between text & numbers";
"Edge+start exceeds dimension bound" = "Edge+start exceeds dimension bound";
"Illegal stride" = "Illegal stride";
"Attribute or variable name contains illegal characters" = "Attribute or variable name contains illegal characters";
"Numeric conversion not representable" = "Numeric conversion not representable";
"Memory allocation (malloc) failure" = "Memory allocation (malloc) failure";